# Pandas-04 Advanced Indexing 

<img src="http://goo.gl/ht49rJ" >


#### 2017 FinanceData http://fb.com/financedata

In [1]:
from IPython.display import display
import pandas as pd

# 인덱싱에 사용하는 메소드
* loc[] - 라벨(label) 인덱싱
* iloc[] - 정수(integer positional) 인덱싱(0 ~ 길이-1)

loc는 라벨로 인덱싱할 때, iloc는 정수(integer)로 인덱싱할 때 사용

In [2]:
data = {
    'A':['KO', 'US', 'EU', 'US', 'EU'], 
    'B':[54, 67, 89, 203, 101], 
    'C':['Seoul', 'New york', 'Paris', 'LA', 'London']}

df = pd.DataFrame(data)
display( df )

    A    B         C
0  KO   54     Seoul
1  US   67  New york
2  EU   89     Paris
3  US  203        LA
4  EU  101    London

# 불리언 인덱스

In [3]:
df['A'] == 'EU'

0    False
1    False
2     True
3    False
4     True
Name: A, dtype: bool

In [4]:
df[ df['A'] == 'EU' ]

    A    B       C
2  EU   89   Paris
4  EU  101  London

# loc 인덱서 (위치, 라벨)
행(Row)/열(Column)에 라벨/위치/불리언 인덱싱이 가능
* 위치(숫자) 인덱싱 가능
* 열에 라벨, 정수 인덱싱 가능
* df.ix[0:2, ['A', 'C']]

In [5]:
# 행(row), 숫자 인덱싱
display (df)
display (df[0:2])  # 정수 인덱싱
display (df.iloc[0:2, 0:2])  # 정수 인덱싱
display (df.iloc[0:2, [0,2]])  # 정수 인덱싱
display (df.loc[0:2, 'A':'B'])  # 라벨 인덱싱
display (df.loc[0:2, ['A','C']])  # 라벨 인덱싱

    A    B         C
0  KO   54     Seoul
1  US   67  New york
2  EU   89     Paris
3  US  203        LA
4  EU  101    London

    A   B         C
0  KO  54     Seoul
1  US  67  New york

    A   B
0  KO  54
1  US  67

    A         C
0  KO     Seoul
1  US  New york

    A   B
0  KO  54
1  US  67
2  EU  89

    A         C
0  KO     Seoul
1  US  New york
2  EU     Paris

In [6]:
# 행(row), 숫자 인덱싱
display( df )
display (df.iloc[[0,2,3]])

    A    B         C
0  KO   54     Seoul
1  US   67  New york
2  EU   89     Paris
3  US  203        LA
4  EU  101    London

    A    B      C
0  KO   54  Seoul
2  EU   89  Paris
3  US  203     LA

In [7]:
# 컬럼, 로우 동시 인덱싱
display (df)
display (df.loc[:1, ['A', 'C']] )
display (df.loc[:1, 'A':'C'])

    A    B         C
0  KO   54     Seoul
1  US   67  New york
2  EU   89     Paris
3  US  203        LA
4  EU  101    London

    A         C
0  KO     Seoul
1  US  New york

    A   B         C
0  KO  54     Seoul
1  US  67  New york

In [8]:
# 로우(row): 라벨 인덱싱, 컬럼: 정수 인덱싱
display (df)
display (df.iloc[3:4, :3])

    A    B         C
0  KO   54     Seoul
1  US   67  New york
2  EU   89     Paris
3  US  203        LA
4  EU  101    London

    A    B   C
3  US  203  LA

# loc 인덱서 (라벨)
* 라벨 인덱싱
* 라벨 리스트, 라벨 슬라이싱
* 불리언 배열

# iloc 인덱서 (정수)
* 정수 인덱싱
* 정수 리스트, 정수 슬라이싱
* 불리언 배열 가능

In [9]:
display( df.loc[1] ) # 단일 인덱싱
display( df.iloc[1] )

display( df.loc[[1,4]] ) # 리스트 인덱싱
display( df.iloc[[1,4]] )

A          US
B          67
C    New york
Name: 1, dtype: object

A          US
B          67
C    New york
Name: 1, dtype: object

    A    B         C
1  US   67  New york
4  EU  101    London

    A    B         C
1  US   67  New york
4  EU  101    London

In [10]:
display( df.loc[1:3] )   # 라벨 슬라이싱
display( df.iloc[1:3] )  # 정수 슬라이싱

    A    B         C
1  US   67  New york
2  EU   89     Paris
3  US  203        LA

    A   B         C
1  US  67  New york
2  EU  89     Paris

# 리뷰
* loc[] - 라벨 인덱싱
* iloc[] - 정수 인덱싱

----
#### 2017 FinanceData http://fb.com/financedata http://financedata.github.com